

START_USER_MESSAGE = (
    "<b>Рады приветствовать тебя, {}!</b>\n"
    "Жми на кнопку и получай QR-код\n\n"
    "❗️Воспользоваться QR-кодом можно единожды❗️"
)


YOU_CANNOT_USE_QR = (
    "❌ Вы больше не можете использовать QR-code, "
    "так как он уже был использован! ❌"
)

USER_CANNOT_USE_QR = (
    "❌ Пользователь больше не можете использовать QR-code, "
    "так как он уже был использован! ❌"
)


CAPTION_TO_THE_QR = (
    "Покажите QR-код администратору!\n\n"
    "❗️После того как вас отметят, вы больше не сможете его использовать❗️"
)


START_ADMIN_MESSAGE = (
    "<b>Приветствую, {}, вы админ!</b>\n"
    "\n"
    "Отсканируйте QR-код пользователя и следуйте инструкциям!"
)


CONFIRMATION_TEXT = (
    '❓ <b>Подтвердите проход пользователя <a href="{}">{}</a>:</b>\n'
)



SMTH_WENT_WRONG = (
    "❌ Что-то пошло не так, попробуйте еще раз!"
)

SUCCESSED = (
    "✅ Успешно {}!"
)

SUCCESS_UPDATED_USER_QR = (
    '✅ Пользователь <a href="{}">{}</a> успешно отмечен!'
)