

START_USER_MESSAGE = (
    "Привет, {}!\n"
    "Рад видеть тебя в нашем ресторане китайской кухни! 🎊\n"
    "Я твой личный помощник и готов подарить тебе <u>скидку 100 рублей</u> на заказ!\n"
    "\n"
    "<b>✨ Как получить купон на СКИДКУ?</b>\n"
    "Просто подпишись на наш официальный Telegram канал:\n"
    "@siyihotpot_ramen\n"
    "После подписки нажми на кнопку <b>“Получить”</b> и забирай свой подарок! 🎁\n"
    "\n"
    "Я вышлю тебе персональный одноразовый код — покажи его официанту при заказе, и мы автоматически вычтем 100 рублей из суммы счета!\n"
    "\n"
    "Успей воспользоваться — предложение действительно для каждого нового подписчика! 😊\n"
    "\n"
    "<i>*Купон не суммируется с другими скидками и акциями ресторана.</i>"
)


YOU_CANNOT_USE_QR = (
    "❌ Вы больше не можете использовать QR-code он уже был использован! ❌"
)

USER_CANNOT_USE_QR = (
    "❌ Пользователь больше не может использовать QR-code ❌"
)


CAPTION_TO_THE_QR = (
    "Твой персональный одноразовый код успешно создан.\n"
    "Покажи его официанту при заказе, и мы автоматически вычтем 100 рублей из суммы счёт!\n"
    "\n"
    "<i>*Купон не суммируется с другими скидками и акциями ресторана.</i>"
)


START_ADMIN_MESSAGE = (
    "<b>Приветствую, {}, вы админ!</b>\n"
    "\n"
    "Отсканируйте QR-код пользователя и следуйте инструкциям!"
)


CONFIRMATION_TEXT = (
    '❓ <b>Подтвердите проход пользователя <a href="{}">{}</a>:</b>\n'
)



SMTH_WENT_WRONG = (
    "❌ Что-то пошло не так, попробуйте еще раз!"
)

SUCCESSED = (
    "✅ Успешно {}!"
)

SUCCESS_UPDATED_USER_QR = (
    '✅ Скидка применена!'
)